docker-code-main-AS/CodeIgniter---aula-18-master/www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients(){
        $ClientModel = new ClientModel();
        $data= [
            'arrayClients' => $ClientModel->findall()
        ];
---
SELECT *
FROM `clients`