docker-code-main-AS/CodeIgniter---aula-18-master/www/codeigniter4/app/Controllers/Product.php

    public function listProducts()
    {
        $ProductModel = new ProductModel();
        $data = [
            'arrayProducts' => $ProductModel->findall()
        ];
---
SELECT *
FROM `products`